{"title":"Introducción","uid":"64f58a743d6f845ad2670994de2abb11","slug":"intro","date":"2021-07-14T21:59:19.000Z","updated":"2024-08-16T21:30:59.421Z","comments":true,"path":"api/articles/intro.json","keywords":null,"cover":"/img/work-731198_640.jpg","content":"<h1 id=\"Introduccion\"><a href=\"#Introduccion\" class=\"headerlink\" title=\"Introducción\"></a>Introducción</h1><p>¡Hola! Este es mi primer post en el blog.</p>\n<p>Para empezar, me gustaría presentarme. Ya tengo una página dedicada a hablar <a href=\"/about\">sobre mi</a>, pero esa página está más enfocada a mostrar mi currículum de cara a los recruiters. En este post me gustaría presentarme de forma más informal, de forma parecida a como me presentaría a los nuevos compañeros (no exactamente así, aquí contaré un poco más sobre mí vida 😋)</p>\n<h2 id=\"Quien-soy\"><a href=\"#Quien-soy\" class=\"headerlink\" title=\"Quien soy\"></a>Quien soy</h2><p>Mi nombre es Darío Rodríguez (si, igual que el nombre de la web, soy muy original 😁). Nací en Cangas do Morrazo, provincia de Pontevedra, pero actualmente resido en Valencia.</p>\n<p>Actualmente trabajo desarrollando aplicaciones web. Mi rol concreto va cambiando según las necesidades la empresa, pero normalmente suelen ser Technical architech, Tech-lead o full-stack developer. Personalmente lo que más me gusta hacer es diseñar y desarrollar la parte backend de las aplicaciones. El lenguaje que más uso a día de hoy es Typescript, pero he trabajado con alguno más: Java, Python, PHP, Groovy (únicamente para crear shared libraries de Jenkins)… (como prodrás ver no he puesto ni HTML ni CSS ya que NO SON LENGUAGES DE PROGRAMACIÓN).</p>\n<p>Soy un apasionado de la tecnología, concretamente de la programación. Suelo dedicar más tiempo del que me gustaría admitir investigando nuevos frameworks, aprendiendo nuevos lenguajes, leyendo libros sobre programación, etc. Esta pasión me suele llevar a aprender sobre todo tipo de cosas, que luego puedo aplicar en mi día a día, y de ahí que mi rol vaya cambiando dependiendo de las necesidades. Estar constantemente aprendiendo también me sirve a la hora de afrontar nuevos retos, ya que por norma general no tengo miedo a enfrontarme a algo que me es desconocido. Con todo esto puedo decir que soy una persona afortunada, ya que mi trabajo está relacionado con una de las cosas que más me gustan hacer, es más, podría llegar a hacerlo aunque no me pagasen por ello.</p>\n<p>Cuando quiero despejar la mente lo que suelo hacer es pasar tiempo con mis hijos, ver series y jugar a videojuegos.</p>\n<h2 id=\"Proposito-del-blog\"><a href=\"#Proposito-del-blog\" class=\"headerlink\" title=\"Propósito del blog\"></a>Propósito del blog</h2><p>El principal propósito del blog es escribir para mi yo del futuro. Aunque existe muchísima información sobre cualquier tema en internet, suele ser bastante difícil encontrar una fuente fiable y completa, por tanto en este blog trataré los temas como a mí me gustaría encontrármelos en internet. Además, escribir sobre algo te impulsa a ser más preciso y a investigar más sobre el tema, así que otro propósito del blog es <em>forzarme</em> a adquirir más conocimiento para poder añadir información más precisa y completa a todos mis posts.</p>\n<p>El último objetivo es poder ayudar a mis compañeros (o a cualquiera) en su aprendizaje. Suelo dedicar tiempo de mi jornada laboral en ayudar a cualquiera que me lo pida, pero hay veces que no puedo llegar a todos. Para esto, intentaré escribir posts sobre lo que más me pregunta la gente y así compartirlo con ellos. Con esto no pretendo pasar un enlace y pasar de la gente, pero si proporcionarle información de forma rápida y cuando me sea posible resolverle las dudas que le queden de forma más directa.</p>\n<p>El idioma de los posts puede variar. Normalmente escribiré en castellano pero si pretendo que algún post llegue a algún compañero fuera de España puede que lo escriba en Inglés.</p>\n<h2 id=\"Tecnologia-del-blog\"><a href=\"#Tecnologia-del-blog\" class=\"headerlink\" title=\"Tecnología del blog\"></a>Tecnología del blog</h2><p>Para este blog he utilizado <a href=\"https://hexo.io/\">hexo</a> con el tema <a href=\"https://github.com/auroral-ui/hexo-theme-aurora\">aurora</a>.</p>\n<p>Los motivos para elegir <a href=\"https://hexo.io/\">hexo</a> fueron:</p>\n<ul>\n<li>No quería base de datos.</li>\n<li>Quería algo que se pudiese desplegar directamente en GitHub pages.</li>\n<li>Debía de ser customizable, pero a la vez que fuese rápido de ponerlo en marcha.</li>\n</ul>\n<p>Con todo esto se me vino a la mente herramientas como <a href=\"https://jekyllrb.com/\">Jekyll</a> o <a href=\"https://gohugo.io/\">Hugo</a>, pero como últimamente me atrae mucho NodeJS decidí buscar algo similar para esa tecnología y fue ahí cuando encontré <a href=\"https://hexo.io/\">hexo</a>. También pensé en <a href=\"https://www.mkdocs.org/\">mkdocs</a>, pero es más para generar páginas estáticas así que lo descarté.</p>\n<p>El tema <a href=\"https://github.com/auroral-ui/hexo-theme-aurora\">aurora</a> simplemente fue “el que más me gustó” dentro de una lista de temas, tampoco me compliqué mucho buscándolo 😅.</p>\n","text":"Introducción¡Hola! Este es mi primer post en el blog. Para empezar, me gustaría presentarme. Ya tengo una página dedicada a hablar sobre mi,...","photos":[],"count_time":{"symbolsCount":"4k","symbolsTime":"4 mins."},"categories":[],"tags":[{"name":"yo","slug":"yo","count":1,"path":"api/tags/yo.json"}],"toc":"<ol class=\"toc\"><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#Introduccion\"><span class=\"toc-text\">Introducción</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Quien-soy\"><span class=\"toc-text\">Quien soy</span></a></li><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Proposito-del-blog\"><span class=\"toc-text\">Propósito del blog</span></a></li><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Tecnologia-del-blog\"><span class=\"toc-text\">Tecnología del blog</span></a></li></ol></li></ol>","author":{"name":"Dario","slug":"dario","avatar":"https://avatars0.githubusercontent.com/u/27199808?v=4","link":"/","description":"Software Architech","socials":{"github":"https://github.com/dario-rodriguez","twitter":"https://x.com/dario_rodrigon","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"linkedIn":{"icon":"/images/linkedin.svg","link":"https://www.linkedin.com/in/dario-rodriguez-gonzalez/"}}}},"mapped":true,"prev_post":{"title":"NestJS","uid":"87f7fda2bbc28a023cd312e8d321db40","slug":"nest","date":"2024-10-14T21:59:19.000Z","updated":"2025-03-10T02:09:45.186Z","comments":true,"path":"api/articles/nest.json","keywords":null,"cover":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/NestJS-logo-wordmark.svg/1920px-NestJS-logo-wordmark.svg.png","text":"Introducción a NestJS: Construyendo Aplicaciones Escalables con Node.jsSi estás buscando un framework robusto y elegante para desarrollar ap...","photos":[],"count_time":{"symbolsCount":"4k","symbolsTime":"4 mins."},"categories":[],"tags":[{"name":"nest","slug":"nest","count":1,"path":"api/tags/nest.json"},{"name":"nodejs","slug":"nodejs","count":1,"path":"api/tags/nodejs.json"},{"name":"express","slug":"express","count":1,"path":"api/tags/express.json"},{"name":"typescript","slug":"typescript","count":1,"path":"api/tags/typescript.json"}],"author":{"name":"Dario","slug":"dario","avatar":"https://avatars0.githubusercontent.com/u/27199808?v=4","link":"/","description":"Software Architech","socials":{"github":"https://github.com/dario-rodriguez","twitter":"https://x.com/dario_rodrigon","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"linkedIn":{"icon":"/images/linkedin.svg","link":"https://www.linkedin.com/in/dario-rodriguez-gonzalez/"}}}}},"next_post":{}}